'''
Домашнее задание:
 Даны формулы: ¬((A ∨ B) ∧ (C ∨ D)) и ((¬A ∧ ¬B) ∨ (¬C ∧ ¬D)). Используя закон Де Моргана, докажите, что эти формулы эквивалентны.

 Напишите программу, которая запрашивает у пользователя два логических значения (True или False) и выводит результаты следующих логических операций:
- Логическое И (and) между двумя значениями.
- Логическое ИЛИ (or) между двумя значениями.
- Логическое НЕ (not) для каждого значения.
- Результат сравнения двух значений на равенство.
- Результат сравнения двух значений на неравенство.

Результаты должны быть выведены с помощью команды print.

Пример вывода:
Введите первое логическое значение (True или False): True
Введите второе логическое значение (True или False): False

Результат логического И: False
Результат логического ИЛИ: True
Результат логического НЕ (для первого значения): False
Результат логического НЕ (для второго значения): True
Результат сравнения на равенство: False
Результат сравнения на неравенство: True
'''


def hw4_1():
    pass


if __name__ == '__main__':
    hw4_1()
